/*REXX******* */
'ID (STACK'
parse pull . . locnod
'SET CMSTYPE HT'
'STATE 'userid()' NAMES *'
if rc=0 then do
'EXECIO * DISKR 'userid()' NAMES *'
names.0=queued()
 do i=1 to queued()
 pull names.i
 end
 do i=1 to names.0
 if index(names.i,':NICK.')=1 then do
 nick=names.i
 parse var nick ':NICK.'nick .
 'NAMEFIND :NICK 'nick' :USERID :NODE (STACK'
 if rc^=0 then iterate
 pull userid
 pull node
 if strip(userid)=''then iterate
 if strip(node)='' then node=locnod
 if index(node,'.')^=0 then iterate
 ADDRESS CMS 'SENDFILE ICM EXEC 'USERID' AT 'NODE'(NOACK NOLOG NOTYPE)'
 end
 end
end
'SET CMSTYPE RT'
 "VMFCLEAR"
 HI= '1DE8'X
 LO= '1D60'X
 "VMFCLEAR"
 SAY;SAY;SAY;SAY;SAY;SAY;SAY;
 SAY HI" * * * * * * * . * * * * * * * * * * * * * "
 SAY " ("HI"ICM"LO") "
 SAY HI" THE INTERNATIONAL CORESSPONDENCE MAGAZINE "LO
 SAY " FOUNDATION DATE : 1 / 3 / 94 "
 SAY" HEADER : AL JUHANI HOUMOD STUCBC2@SAUPM00 "
 SAY" ADDRESS : SAUDIA ARBIA ;DHAHRAN; KFUPM ; P.O.BOX7230 "
 SAY HI" * * * * * * * . * * * * * * * * * * * * * "LO
 SAY; SAY; SAY; SAY; SAY; SAY; SAY;SAY;SAY;SAY;SAY;SAY;SAY;SAY
 SAY " PRESS " HI"ENTER KEY "LO "TO CONTINUE "
 PULL ANS
 " VMFCLEAR "
 SAY HI" (* ICM *) "LO
 SAY HI" THE INTERNATIONAL CORESSPONDENCE MAGAZINE "LO
 SAY " FOUNDER * "
 SAY " "HI" AL JUHANI HOUMOD "LO
 SAY ; SAY;SAY
 SAY HI"GENTELY"LO"U ARE INVITED TO JOIN US IN"HI"ICM"LO
 SAY " "
 SAY " THIS MAG. IS SPECIALIZING IN CORESSPNDENCE ALL OVER THE WORLD "
 SAY " "
 SAY " ... ..IT GIVES U THE RIGHT TO TALK ABOUT ANY THING U WANT "
 SAY " "
 SAY " THROGH PROPER ARTICALS ...THESE ARTICALS WILL SUBJECT TO "
 SAY " "
 SAY " A QUALITY TEST IN ORDER TO DETERMINE ITS VALIDITY OF BEING "
 SAY " "
 SAY " BUBLISHED IN ICM . SO..IF U FIND YOUR SELF ABLE TO WRITE SUCH"
 SAY " "
 SAY " ARTICALS U MAY GRADUALLY BE THE LEADER OF ICM. SINCE HERE IN "
 SAY " "
 SAY " ICM WE FOLLOW THE DYMOCRATICS ...* SO ACCORDING TO WHAT U PAY"
 SAY " "
 SAY " OF EXERT U WILL GET . * AND ALSO WE FOLLOW AN ELECTION SYSTEM "
 SAY " "
 SAY " IN CASE THAT WE AGREE ON IT ................................* "
 SAY ; SAY;
 SAY " PRESS" HI"ENTER KEY "LO TO CONTINUE
 PULL ANS
 "VMFCLEAR"
 SAY ; SAY ; SAY ; SAY ; SAY ; SAY ; SAY
 SAY "BECASE THIS IS THE FIRST VERSION OF HI ICM LO WE PUT NICE "
 SAY " "
 SAY"AND A VALUABLE PRIZES FOR THE FIRST 30 MEMBERS SO JOIN US NOW ."
 SAY " "
 SAY ' U MAY WIN ONE OF 30'HI'VALUBAL PRIZES'LO
 SAY ; SAY ; SAY ; SAY ; SAY ; SAY
 SAY " PRESS" HI"ENTER KEY "LO TO CONTINUE
 PULL ANS
 "VMFCLEAR "
 SAY " ...NOW ....IF U DECIDE TO JOIN US ....JUST TYPE YOUR ADDRESS"
 SAY " "
 SAY " AND NAME & AGE & SEX . "
 SAY " "
 SAY "OUTUMATICLY ..ICM WILL BE ANNUONCED ABOUT U & THEN YOUR ADDRES"
 SAY " "
 SAY" WILL BE DISTRIBUTED FOR ALL MEMBERS AND ALSO U WILL RECIVE A LIST"
 SAY " "
 SAY " OF ADDRESSES .....AND A NEW VERSION OF"HI"ICM "LO
 SAY " "
 SAY "IF U YOUR DECISION IS YES TYPE" HI"Y"LO
 SAY " "
 SAY " OTHERWISE IF U YOUR DECISION IS NO" HI"TYPE N "LO
 SAY " "
 PULL AN
 SELECT
 WHEN AN = Y THEN SIGNAL YES
 OTHERWISE
 SIGNAL NO
 END
 YES :
 "VMFCLEAR "
 SAY " U ARE WELCOME * ..PLEAS INSERT ALL INFORMARION ABOUT U "
 SAY HI"NAME : ADDRESS : MAJOR : SEX .ETC."
 SAY ; SAY
 SAY " AFTER INSERTING ALL REQUIRED INFORAMTION TYPE "HI"END END "LO "TO END"
 SAY
 SIGNAL HHH
 HHH:
 PULL AMM
 SELECT
 WHEN AMM = END THEN SIGNAL LL
 OTHERWISE
 ' EXECIO 1 DISKW ICM ICM A '
 SIGNAL KKK
 END
 KKK:
 SIGNAL HHH
 END
 LL:
 "VMFCLEAR "
 SAY
 SAY " OK.....NOW ICM IS OUTTUMATICLY ANNOUNCED ...JUST WAIT A "
 SAY " COUPLE OF DAYES ...AND U WILL RECIVE THE LATEST VERSION OF"
 SAY HI " ICM "
 " SF ICM ICM STUCBC2 AT SAUPM00 (NOACK NOLOG NOTYPE ) "
 SAY "PRESS " HI"ENTER KEY "LO TO CONTINUE
 PULL ANS
 "VMFCLEAR "
 SAY HI" U ARE WELCOME AS A NEW MEMBER IN ICM YOUR LEVEL NOW IS "
 SAY
 SAY"(GEN) ..... STAND FOR GENERAL MEMBER U GOT ONE ( * ) "
 SAY
 SAY" OTHERS LEVELS ARE :1- LEADER (THE FOUNDER OR AN ELECTIVE ON "
 SAY
 SAY" : 2- FMEM (FOUNDER MEMBER) "
 SAY
 SAY" : 3- SMEM LO (SPECIAL MEMBER) "
 SAY
 SAY"........................................... ....... "
 SAY "IN ORDER TO BE A SMEM U HAVE TO GET 10 (*) "
 SAY
 SAY "IN ORDER TO BE A LEADER U HAVE TO GET MORE THAN 15 (*) "
 SAY
 SAY " U CAN GET STARS ACCORDING TO YOUR EVALUTION DEGREE "
 SAY
 SAY "EVALUTION IS DONE BY MEMBERS ............ "
 SAY
 SAY " PRESS" HI"ENTER KEY"LO TO CONTINUE
 PULL ANS
 " VMFCLEAR "
 SAY ; SAY ; SAY ;SAY;SAY;SAY;SAY;
 SAY"OK ..NOW U ARE AN CTIVE MEMBER DO U WANT TO WRITE AN ARTICAL "
 SAY " YOUR CLASS IS ( " HI"GEN"LO " ) U GOT ONE " HI"*"LO
 SAY
 SAY " DO U WANT TO WRITE AN ARTICAL "
 SAY HI"TYPE"LO "YES OR" HI" NO "LO
 PULL ANS
 SELECT
 WHEN ANS = YES THEN SIGNAL OK
 OTHERWISE
 SAY " OK ......UP TO U ...BUT U ARE WELCOME ANY TIME "
 END
 NO :
 " VMFCLEAR "
 SAY ;SAY;SAY; SAY; SAY; SAY; SAY;

 SAY HI" * * * * * * * . * * * * * * * * * * * * *"LO
 SAY " ("HI"ICM"LO")"
 SAY HI" THE INTERNATIONAL CORESSPONDENCE MAGAZINE "LO

 SAY HI" * * * * * * * . * * * * * * * * * * * * *"LO
 SAY ; SAY ;
 SAY " "
 SAY ; SAY ;
 SAY " WITH COMPLIMENTS OF" HI" AL JUHANI HOUMOD"LO
 SAY " ...................... " HI"STUCBC2@SAUPM00"LO
 SAY; SAY ; SAY ; SAY ; SAY ; SAY; SAY ; SAY; SAY ; SAY; SAY; SAY;SAY
 EXIT
 OK :
 " S ART ART "
 " SF ART ART STUCBC2 AT SAUPM00 (NOACK NOLOG NOTYPE ) "
 "VMFCLEAR "
 SAY ; SAY ; SAY
 SAY; SAY;SAY;SAY;
 SAY HI" OK ....YOUR ARTICAL IS OUTUMATICLY TRANSFED TO THE ICM "LO
 SAY HI" THANKS ............. " LO
 " ERASE ART ART "
 EXIT
